In [1]:
import pandas as pd
import numpy as np

In [2]:
age = np.random.randint(10,100,15)

In [3]:
age

array([63, 13, 98, 94, 53, 71, 61, 80, 14, 65, 89, 58, 47, 22, 12])

In [4]:
s = pd.Series(age) #column view

In [5]:
s.head() # by default it will return first 5 values

0    63
1    13
2    98
3    94
4    53
5    71
6    61
7    80
dtype: int64

In [7]:
s.tail()

10    64
11    11
12    40
13    52
14    89
dtype: int32

In [8]:
s[0]

82

In [9]:
s[0:5]

0    82
1    13
2    81
3    86
4    21
dtype: int32

In [6]:
data = {
    "scores" : np.random.randint(20,120,8),
    "names" : np.array(['Sachin','Dhoni','Kohli','Yuvraj','Raina','Rohit','Rishabh','Jadeja']),
    "catches" : np.random.randint(1,6,8),
    "average" : np.random.randint(40,55,8)
}

In [7]:
data

{'scores': array([78, 60, 46, 83, 76, 89, 70, 37]),
 'names': array(['Sachin', 'Dhoni', 'Kohli', 'Yuvraj', 'Raina', 'Rohit', 'Rishabh',
        'Jadeja'], dtype='<U7'),
 'catches': array([1, 2, 2, 2, 4, 4, 3, 5]),
 'average': array([51, 50, 45, 52, 51, 54, 51, 48])}

In [8]:
df = pd.DataFrame(data)

In [18]:
df

   scores    names  catches  average
0      23   Sachin        2       54
1      27    Dhoni        4       48
2      71    Kohli        2       49
3     108   Yuvraj        3       43
4      87    Raina        5       48
5      92    Rohit        4       48
6     116  Rishabh        2       54
7      59   Jadeja        3       48

In [9]:
df.head()

   scores   names  catches  average
0      78  Sachin        1       51
1      60   Dhoni        2       50
2      46   Kohli        2       45
3      83  Yuvraj        2       52
4      76   Raina        4       51

In [10]:
df[df['catches'] >= 4]

   scores   names  catches  average
4      76   Raina        4       51
5      89   Rohit        4       54
7      37  Jadeja        5       48

In [22]:
df[df['catches'] >= 4][['names','average']]

   names  average
1  Dhoni       48
4  Raina       48
5  Rohit       48